ПД_sev/src/Documents/РабочееВремя/РабочееВремя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РабочееВремя</name>
  <basedOn>Catalog.Проекты</basedOn>
  <registerRecords>AccumulationRegister.Начисления</registerRecords>
  <registerRecords>AccumulationRegister.ПрибыльПоПроектам</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомпенсироватьТолькоПереработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТСД</name>
    <type>
      <types>CatalogRef.МП_ВнешниеУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабельРабочегоВремени</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВНачисление</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Координаты</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Широта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долгота</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ПД_sev/src/Documents/РабочееВремя/ManagerModule.bsl
Функция СоздатьОбновитьДокументРабочееВремя(стрПараметры) Экспорт 
	ДокументОбъект = Документы.РабочееВремя.СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДата();
	ДокументОбъект.Сотрудник = стрПараметры.Сотрудник;//ПараметрыСеанса.ТекущийПользователь.Сотрудник;
	ДокументОбъект.Проект = стрПараметры.Проект;
	ДокументОбъект.Согласовано = Ложь;
	ДокументОбъект.Комментарий = стрПараметры.Комментарий;
	//ДокументОбъект.ТСД = ссылкаТСД; 
	
	ДокументОбъект.КомпенсироватьТолькоПереработки = стрПараметры.Сотрудник.КомпенсироватьТолькоПереработки;	
	ДокументОбъект.ТабельРабочегоВремени.Очистить();
	НоваяСтрокаРабВремя = ДокументОбъект.ТабельРабочегоВремени.Добавить();
	НоваяСтрокаРабВремя.Дата = ТекущаяДата();
	НоваяСтрокаРабВремя.ДеньНедели = УправлениеРабочимВременем.ПолучитьДеньНеделиПоДате(НоваяСтрокаРабВремя.Дата);
	НоваяСтрокаРабВремя.ВремяНачала = стрПараметры.ВремяНачала;	
	НоваяСтрокаРабВремя.ВремяОкончания = стрПараметры.ВремяОкончания;

	ТаблицаДанных = ДокументОбъект.ТабельРабочегоВремени.Выгрузить();
	УправлениеРабочимВременем.РаздробитьСтрокиКТЗНаРабочиеЧасы(ТаблицаДанных, ДокументОбъект.КомпенсироватьТолькоПереработки, ДокументОбъект.Дата);
	ДокументОбъект.ТабельРабочегоВремени.Загрузить(ТаблицаДанных);
	Если стрПараметры.Свойство("КоординатыНачала") Тогда
		ДобавитьСтрокуКоординат(ДокументОбъект.Координаты, стрПараметры.КоординатыНачала);		
	КонецЕсли;
	Если стрПараметры.Свойство("КоординатыЗавершения") Тогда
		ДобавитьСтрокуКоординат(ДокументОбъект.Координаты, стрПараметры.КоординатыЗавершения);		
	КонецЕсли;

	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Возврат ДокументОбъект.Ссылка;
КонецФункции

Процедура ДобавитьСтрокуКоординат(КоординатыТЧ, стрЗаполнение)
	НоваяСтрока = КоординатыТЧ.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, стрЗаполнение);
	//НоваяСтрока
КонецПроцедуры
